---
kind: method
id: M:Autodesk.Revit.ApplicationServices.Application.RegisterFailuresProcessor(Autodesk.Revit.DB.IFailuresProcessor)
source: html/f94dffd6-2b7c-7249-1683-caeee08a4668.htm
---
# Autodesk.Revit.ApplicationServices.Application.RegisterFailuresProcessor Method

Replaces Revit's default user interface (if present) with alternative handling for all warnings and errors
 (including those not generated by your application) for the rest of the Revit session;
 if your application is not prepared to respond to all warnings and errors,
 consider use of IFailuresPreprocessor (in your opened Transaction)
 or the FailuresProcessing event instead of this interface.

## Syntax (C#)
```csharp
public static void RegisterFailuresProcessor(
	IFailuresProcessor processor
)
```

## Parameters
- **processor** (`Autodesk.Revit.DB.IFailuresProcessor`) - Instance of Failures Processor to be used by the Revit Application.

## Remarks
If there is previously registered Failures Processor, it gets discarded.
 If you opt to register a FailuresProcessor for Revit, your processor will become the default error handler
 for all Revit errors for the session. The standard Revit error dialog will not appear.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null